app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks"
---
  def index
    return @tasks = Task.all

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    task_id = params[:id]
    @task = Task.find(task_id)